{
  "architectures": [
    "Qwen2MoeForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "decoder_sparse_step": 1,
  "eos_token_id": 151643,
  "hidden_act": "silu",
  "hidden_size": 32,
  "initializer_range": 0.02,
  "intermediate_size": 22,
  "max_position_embeddings": 256,
  "max_window_layers": 2,
  "mlp_only_layers": [],
  "model_type": "qwen2_moe",
  "moe_intermediate_size": 44,
  "norm_topk_prob": false,
  "num_attention_heads": 4,
  "num_experts": 8,
  "num_experts_per_tok": 4,
  "num_hidden_layers": 4,
  "num_key_value_heads": 2,
  "output_router_logits": false,
  "qkv_bias": true,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 1000000.0,
  "router_aux_loss_coef": 0.001,
  "shared_expert_intermediate_size": 22,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.50.0",
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 151936
}
